Revit 2024 API
SpecTypeId.CableTraySize Property
 Cable Tray Size, in discipline Electrical.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public static ForgeTypeId CableTraySize { get; }
Visual Basic
Public Shared ReadOnly Property CableTraySize As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ CableTraySize {
	ForgeTypeId^ get ();
}
See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace